
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 25 to add, 0 to change, 21 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.b2c_config[&#34;21&#34;]
  * azurerm_storage_blob.b2c_config[&#34;22&#34;]
  * azurerm_storage_blob.b2c_config[&#34;23&#34;]
  * azurerm_storage_blob.b2c_config[&#34;24&#34;]
* Replace
  * azurerm_storage_blob.b2c_config[&#34;0&#34;]
  * azurerm_storage_blob.b2c_config[&#34;1&#34;]
  * azurerm_storage_blob.b2c_config[&#34;10&#34;]
  * azurerm_storage_blob.b2c_config[&#34;11&#34;]
  * azurerm_storage_blob.b2c_config[&#34;12&#34;]
  * azurerm_storage_blob.b2c_config[&#34;13&#34;]
  * azurerm_storage_blob.b2c_config[&#34;14&#34;]
  * azurerm_storage_blob.b2c_config[&#34;15&#34;]
  * azurerm_storage_blob.b2c_config[&#34;16&#34;]
  * azurerm_storage_blob.b2c_config[&#34;17&#34;]
  * azurerm_storage_blob.b2c_config[&#34;18&#34;]
  * azurerm_storage_blob.b2c_config[&#34;19&#34;]
  * azurerm_storage_blob.b2c_config[&#34;2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;20&#34;]
  * azurerm_storage_blob.b2c_config[&#34;3&#34;]
  * azurerm_storage_blob.b2c_config[&#34;4&#34;]
  * azurerm_storage_blob.b2c_config[&#34;5&#34;]
  * azurerm_storage_blob.b2c_config[&#34;6&#34;]
  * azurerm_storage_blob.b2c_config[&#34;7&#34;]
  * azurerm_storage_blob.b2c_config[&#34;8&#34;]
  * azurerm_storage_blob.b2c_config[&#34;9&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_config["0"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = <<-EOT # forces replacement
          - css/main.css
          + <!DOCTYPE html>
          + <html lang="en" class="govuk-template">
          +   <head>
          +     <title>Pre-Recorded Evidence Account - GOV.UK</title>
          + 
          +     <meta name="viewport" content="width=device-width, initial-scale=1, viewport-fit=cover">
          +     <meta name="theme-color" content="#0b0c0c">
          + 
          +     <link rel="stylesheet" href="https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css">
          + 
          +     <link rel="manifest" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/manifest.json">
          +     <link rel="icon" sizes="48x48" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico">
          +     <link rel="icon" sizes="any" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" type="image/svg+xml">
          +     <link rel="mask-icon" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" color="#0b0c0c">
          +     <link rel="apple-touch-icon" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png">
          + 
          +     <script src="https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" defer></script>
          +   </head>
          +   <body class="govuk-template__body">
          +     <script>document.body.className += ' js-enabled' + ('noModule' in HTMLScriptElement.prototype ? ' govuk-frontend-supported' : '');</script>
          + 
          +     <a href="#main-content" class="govuk-skip-link" data-module="govuk-skip-link">Skip to main content</a>
          +     <header class="govuk-header" role="banner" data-module="govuk-header">
          +       <div class="govuk-header__container govuk-width-container">
          +         <div class="govuk-header__logo">
          +           <a href="https://pre-portal.staging.platform.hmcts.net/" class="govuk-header__link govuk-header__link--homepage">
          +             <svg focusable="false" role="img" class="govuk-header__logotype" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 148 30" height="30" width="148" aria-label="GOV.UK">
          +               <title>GOV.UK</title>
          +               <path d="M22.6 10.4c-1 .4-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s-.1 2-1 2.4m-5.9 6.7c-.9.4-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s-.1 2-1 2.4m10.8-3.7c-1 .4-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s0 2-1 2.4m3.3 4.8c-1 .4-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s-.1 2-1 2.4M17 4.7l2.3 1.2V2.5l-2.3.7-.2-.2.9-3h-3.4l.9 3-.2.2c-.1.1-2.3-.7-2.3-.7v3.4L15 4.7c.1.1.1.2.2.2l-1.3 4c-.1.2-.1.4-.1.6 0 1.1.8 2 1.9 2.2h.7c1-.2 1.9-1.1 1.9-2.1 0-.2 0-.4-.1-.6l-1.3-4c-.1-.2 0-.2.1-.3m-7.6 5.7c.9.4 2-.1 2.4-1 .4-.9-.1-2-1-2.4-.9-.4-2 .1-2.4 1s0 2 1 2.4m-5 3c.9.4 2-.1 2.4-1 .4-.9-.1-2-1-2.4-.9-.4-2 .1-2.4 1s.1 2 1 2.4m-3.2 4.8c.9.4 2-.1 2.4-1 .4-.9-.1-2-1-2.4-.9-.4-2 .1-2.4 1s0 2 1 2.4m14.8 11c4.4 0 8.6.3 12.3.8 1.1-4.5 2.4-7 3.7-8.8l-2.5-.9c.2 1.3.3 1.9 0 2.7-.4-.4-.8-1.1-1.1-2.3l-1.2 4c.7-.5 1.3-.8 2-.9-1.1 2.5-2.6 3.1-3.5 3-1.1-.2-1.7-1.2-1.5-2.1.3-1.2 1.5-1.5 2.1-.1 1.1-2.3-.8-3-2-2.3 1.9-1.9 2.1-3.5.6-5.6-2.1 1.6-2.1 3.2-1.2 5.5-1.2-1.4-3.2-.6-2.5 1.6.9-1.4 2.1-.5 1.9.8-.2 1.1-1.7 2.1-3.5 1.9-2.7-.2-2.9-2.1-2.9-3.6.7-.1 1.9.5 2.9 1.9l.4-4.3c-1.1 1.1-2.1 1.4-3.2 1.4.4-1.2 2.1-3 2.1-3h-5.4s1.7 1.9 2.1 3c-1.1 0-2.1-.2-3.2-1.4l.4 4.3c1-1.4 2.2-2 2.9-1.9-.1 1.5-.2 3.4-2.9 3.6-1.9.2-3.4-.8-3.5-1.9-.2-1.3 1-2.2 1.9-.8.7-2.3-1.2-3-2.5-1.6.9-2.2.9-3.9-1.2-5.5-1.5 2-1.3 3.7.6 5.6-1.2-.7-3.1 0-2 2.3.6-1.4 1.8-1.1 2.1.1.2.9-.3 1.9-1.5 2.1-.9.2-2.4-.5-3.5-3 .6 0 1.2.3 2 .9l-1.2-4c-.3 1.1-.7 1.9-1.1 2.3-.3-.8-.2-1.4 0-2.7l-2.9.9C1.3 23 2.6 25.5 3.7 30c3.7-.5 7.9-.8 12.3-.8m28.3-11.6c0 .9.1 1.7.3 2.5.2.8.6 1.5 1 2.2.5.6 1 1.1 1.7 1.5.7.4 1.5.6 2.5.6.9 0 1.7-.1 2.3-.4s1.1-.7 1.5-1.1c.4-.4.6-.9.8-1.5.1-.5.2-1 .2-1.5v-.2h-5.3v-3.2h9.4V28H55v-2.5c-.3.4-.6.8-1 1.1-.4.3-.8.6-1.3.9-.5.2-1 .4-1.6.6s-1.2.2-1.8.2c-1.5 0-2.9-.3-4-.8-1.2-.6-2.2-1.3-3-2.3-.8-1-1.4-2.1-1.8-3.4-.3-1.4-.5-2.8-.5-4.3s.2-2.9.7-4.2c.5-1.3 1.1-2.4 2-3.4.9-1 1.9-1.7 3.1-2.3 1.2-.6 2.6-.8 4.1-.8 1 0 1.9.1 2.8.3.9.2 1.7.6 2.4 1s1.4.9 1.9 1.5c.6.6 1 1.3 1.4 2l-3.7 2.1c-.2-.4-.5-.9-.8-1.2-.3-.4-.6-.7-1-1-.4-.3-.8-.5-1.3-.7-.5-.2-1.1-.2-1.7-.2-1 0-1.8.2-2.5.6-.7.4-1.3.9-1.7 1.5-.5.6-.8 1.4-1 2.2-.3.8-.4 1.9-.4 2.7zM71.5 6.8c1.5 0 2.9.3 4.2.8 1.2.6 2.3 1.3 3.1 2.3.9 1 1.5 2.1 2 3.4s.7 2.7.7 4.2-.2 2.9-.7 4.2c-.4 1.3-1.1 2.4-2 3.4-.9 1-1.9 1.7-3.1 2.3-1.2.6-2.6.8-4.2.8s-2.9-.3-4.2-.8c-1.2-.6-2.3-1.3-3.1-2.3-.9-1-1.5-2.1-2-3.4-.4-1.3-.7-2.7-.7-4.2s.2-2.9.7-4.2c.4-1.3 1.1-2.4 2-3.4.9-1 1.9-1.7 3.1-2.3 1.2-.5 2.6-.8 4.2-.8zm0 17.6c.9 0 1.7-.2 2.4-.5s1.3-.8 1.7-1.4c.5-.6.8-1.3 1.1-2.2.2-.8.4-1.7.4-2.7v-.1c0-1-.1-1.9-.4-2.7-.2-.8-.6-1.6-1.1-2.2-.5-.6-1.1-1.1-1.7-1.4-.7-.3-1.5-.5-2.4-.5s-1.7.2-2.4.5-1.3.8-1.7 1.4c-.5.6-.8 1.3-1.1 2.2-.2.8-.4 1.7-.4 2.7v.1c0 1 .1 1.9.4 2.7.2.8.6 1.6 1.1 2.2.5.6 1.1 1.1 1.7 1.4.6.3 1.4.5 2.4.5zM88.9 28 83 7h4.7l4 15.7h.1l4-15.7h4.7l-5.9 21h-5.7zm28.8-3.6c.6 0 1.2-.1 1.7-.3.5-.2 1-.4 1.4-.8.4-.4.7-.8.9-1.4.2-.6.3-1.2.3-2v-13h4.1v13.6c0 1.2-.2 2.2-.6 3.1s-1 1.7-1.8 2.4c-.7.7-1.6 1.2-2.7 1.5-1 .4-2.2.5-3.4.5-1.2 0-2.4-.2-3.4-.5-1-.4-1.9-.9-2.7-1.5-.8-.7-1.3-1.5-1.8-2.4-.4-.9-.6-2-.6-3.1V6.9h4.2v13c0 .8.1 1.4.3 2 .2.6.5 1 .9 1.4.4.4.8.6 1.4.8.6.2 1.1.3 1.8.3zm13-17.4h4.2v9.1l7.4-9.1h5.2l-7.2 8.4L148 28h-4.9l-5.5-9.4-2.7 3V28h-4.2V7zm-27.6 16.1c-1.5 0-2.7 1.2-2.7 2.7s1.2 2.7 2.7 2.7 2.7-1.2 2.7-2.7-1.2-2.7-2.7-2.7z"></path>
          +             </svg>
          +           </a>
          +         </div>
          +         <div class="govuk-header__content">
          +           <a href="https://pre-portal.staging.platform.hmcts.net/" class="govuk-header__link govuk-header__service-name">
          +             HMCTS Pre-Recorded Evidence Service
          +           </a>
          +         </div>
          +       </div>
          +     </header>
          + 
          +     <main class="govuk-main-wrapper" id="main-content" role="main">
          +       <div class="govuk-width-container">
          +           <div class="govuk-grid-row">
          +             <div class="govuk-grid-column-two-thirds">
          + 
          +               <div id="api">
          +                 <!-- B2C content goes here -->
          +               </div>
          + 
          +             </div>
          +           </div>
          +       </div>
          +     </main>
          + 
          +     <footer class="govuk-footer" role="contentinfo">
          +       <div class="govuk-width-container">
          +         <div class="govuk-footer__meta">
          +           <div class="govuk-footer__meta-item govuk-footer__meta-item--grow">
          +             <h2 class="govuk-visually-hidden">Support links</h2>
          +             <ul class="govuk-footer__inline-list">
          +               <li class="govuk-footer__inline-list-item">
          +                 <a class="govuk-footer__link" href="https://pre-portal.staging.platform.hmcts.net/terms-and-conditions" target="_blank">
          +                   Terms and conditions
          +                 </a>
          +               </li>
          +               <li class="govuk-footer__inline-list-item">
          +                 <a class="govuk-footer__link" href="https://pre-portal.staging.platform.hmcts.net/accessibility-statement" target="_blank">
          +                   Accessibility statement
          +                 </a>
          +               </li>
          +             </ul>
          +             <svg aria-hidden="true" focusable="false" class="govuk-footer__licence-logo" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 483.2 195.7" height="17" width="41">
          +               <path fill="currentColor" d="M421.5 142.8V.1l-50.7 32.3v161.1h112.4v-50.7zm-122.3-9.6A47.12 47.12 0 0 1 221 97.8c0-26 21.1-47.1 47.1-47.1 16.7 0 31.4 8.7 39.7 21.8l42.7-27.2A97.63 97.63 0 0 0 268.1 0c-36.5 0-68.3 20.1-85.1 49.7A98 98 0 0 0 97.8 0C43.9 0 0 43.9 0 97.8s43.9 97.8 97.8 97.8c36.5 0 68.3-20.1 85.1-49.7a97.76 97.76 0 0 0 149.6 25.4l19.4 22.2h3v-87.8h-80l24.3 27.5zM97.8 145c-26 0-47.1-21.1-47.1-47.1s21.1-47.1 47.1-47.1 47.2 21 47.2 47S123.8 145 97.8 145"></path>
          +             </svg>
          +             <span class="govuk-footer__licence-description">
          +                 All content is available under the
          +                 <a class="govuk-footer__link" href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
          +             </span>
          +           </div>
          +           <div class="govuk-footer__meta-item">
          +             <a class="govuk-footer__link govuk-footer__copyright-logo" href="https://www.nationalarchives.gov.uk/information-management/re-using-public-sector-information/uk-government-licensing-framework/crown-copyright/">© Crown copyright</a>
          +           </div>
          +         </div>
          +       </div>
          +     </footer>
          +   </body>
          + </html>
        EOT
      ~ source                 = <<-EOT # forces replacement
          - ./b2c/views/css/main.css
          + ./b2c/views/<!DOCTYPE html>
          + <html lang="en" class="govuk-template">
          +   <head>
          +     <title>Pre-Recorded Evidence Account - GOV.UK</title>
          + 
          +     <meta name="viewport" content="width=device-width, initial-scale=1, viewport-fit=cover">
          +     <meta name="theme-color" content="#0b0c0c">
          + 
          +     <link rel="stylesheet" href="https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css">
          + 
          +     <link rel="manifest" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/manifest.json">
          +     <link rel="icon" sizes="48x48" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico">
          +     <link rel="icon" sizes="any" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" type="image/svg+xml">
          +     <link rel="mask-icon" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" color="#0b0c0c">
          +     <link rel="apple-touch-icon" href="https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png">
          + 
          +     <script src="https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" defer></script>
          +   </head>
          +   <body class="govuk-template__body">
          +     <script>document.body.className += ' js-enabled' + ('noModule' in HTMLScriptElement.prototype ? ' govuk-frontend-supported' : '');</script>
          + 
          +     <a href="#main-content" class="govuk-skip-link" data-module="govuk-skip-link">Skip to main content</a>
          +     <header class="govuk-header" role="banner" data-module="govuk-header">
          +       <div class="govuk-header__container govuk-width-container">
          +         <div class="govuk-header__logo">
          +           <a href="https://pre-portal.staging.platform.hmcts.net/" class="govuk-header__link govuk-header__link--homepage">
          +             <svg focusable="false" role="img" class="govuk-header__logotype" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 148 30" height="30" width="148" aria-label="GOV.UK">
          +               <title>GOV.UK</title>
          +               <path d="M22.6 10.4c-1 .4-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s-.1 2-1 2.4m-5.9 6.7c-.9.4-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s-.1 2-1 2.4m10.8-3.7c-1 .4-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s0 2-1 2.4m3.3 4.8c-1 .4-2-.1-2.4-1-.4-.9.1-2 1-2.4.9-.4 2 .1 2.4 1s-.1 2-1 2.4M17 4.7l2.3 1.2V2.5l-2.3.7-.2-.2.9-3h-3.4l.9 3-.2.2c-.1.1-2.3-.7-2.3-.7v3.4L15 4.7c.1.1.1.2.2.2l-1.3 4c-.1.2-.1.4-.1.6 0 1.1.8 2 1.9 2.2h.7c1-.2 1.9-1.1 1.9-2.1 0-.2 0-.4-.1-.6l-1.3-4c-.1-.2 0-.2.1-.3m-7.6 5.7c.9.4 2-.1 2.4-1 .4-.9-.1-2-1-2.4-.9-.4-2 .1-2.4 1s0 2 1 2.4m-5 3c.9.4 2-.1 2.4-1 .4-.9-.1-2-1-2.4-.9-.4-2 .1-2.4 1s.1 2 1 2.4m-3.2 4.8c.9.4 2-.1 2.4-1 .4-.9-.1-2-1-2.4-.9-.4-2 .1-2.4 1s0 2 1 2.4m14.8 11c4.4 0 8.6.3 12.3.8 1.1-4.5 2.4-7 3.7-8.8l-2.5-.9c.2 1.3.3 1.9 0 2.7-.4-.4-.8-1.1-1.1-2.3l-1.2 4c.7-.5 1.3-.8 2-.9-1.1 2.5-2.6 3.1-3.5 3-1.1-.2-1.7-1.2-1.5-2.1.3-1.2 1.5-1.5 2.1-.1 1.1-2.3-.8-3-2-2.3 1.9-1.9 2.1-3.5.6-5.6-2.1 1.6-2.1 3.2-1.2 5.5-1.2-1.4-3.2-.6-2.5 1.6.9-1.4 2.1-.5 1.9.8-.2 1.1-1.7 2.1-3.5 1.9-2.7-.2-2.9-2.1-2.9-3.6.7-.1 1.9.5 2.9 1.9l.4-4.3c-1.1 1.1-2.1 1.4-3.2 1.4.4-1.2 2.1-3 2.1-3h-5.4s1.7 1.9 2.1 3c-1.1 0-2.1-.2-3.2-1.4l.4 4.3c1-1.4 2.2-2 2.9-1.9-.1 1.5-.2 3.4-2.9 3.6-1.9.2-3.4-.8-3.5-1.9-.2-1.3 1-2.2 1.9-.8.7-2.3-1.2-3-2.5-1.6.9-2.2.9-3.9-1.2-5.5-1.5 2-1.3 3.7.6 5.6-1.2-.7-3.1 0-2 2.3.6-1.4 1.8-1.1 2.1.1.2.9-.3 1.9-1.5 2.1-.9.2-2.4-.5-3.5-3 .6 0 1.2.3 2 .9l-1.2-4c-.3 1.1-.7 1.9-1.1 2.3-.3-.8-.2-1.4 0-2.7l-2.9.9C1.3 23 2.6 25.5 3.7 30c3.7-.5 7.9-.8 12.3-.8m28.3-11.6c0 .9.1 1.7.3 2.5.2.8.6 1.5 1 2.2.5.6 1 1.1 1.7 1.5.7.4 1.5.6 2.5.6.9 0 1.7-.1 2.3-.4s1.1-.7 1.5-1.1c.4-.4.6-.9.8-1.5.1-.5.2-1 .2-1.5v-.2h-5.3v-3.2h9.4V28H55v-2.5c-.3.4-.6.8-1 1.1-.4.3-.8.6-1.3.9-.5.2-1 .4-1.6.6s-1.2.2-1.8.2c-1.5 0-2.9-.3-4-.8-1.2-.6-2.2-1.3-3-2.3-.8-1-1.4-2.1-1.8-3.4-.3-1.4-.5-2.8-.5-4.3s.2-2.9.7-4.2c.5-1.3 1.1-2.4 2-3.4.9-1 1.9-1.7 3.1-2.3 1.2-.6 2.6-.8 4.1-.8 1 0 1.9.1 2.8.3.9.2 1.7.6 2.4 1s1.4.9 1.9 1.5c.6.6 1 1.3 1.4 2l-3.7 2.1c-.2-.4-.5-.9-.8-1.2-.3-.4-.6-.7-1-1-.4-.3-.8-.5-1.3-.7-.5-.2-1.1-.2-1.7-.2-1 0-1.8.2-2.5.6-.7.4-1.3.9-1.7 1.5-.5.6-.8 1.4-1 2.2-.3.8-.4 1.9-.4 2.7zM71.5 6.8c1.5 0 2.9.3 4.2.8 1.2.6 2.3 1.3 3.1 2.3.9 1 1.5 2.1 2 3.4s.7 2.7.7 4.2-.2 2.9-.7 4.2c-.4 1.3-1.1 2.4-2 3.4-.9 1-1.9 1.7-3.1 2.3-1.2.6-2.6.8-4.2.8s-2.9-.3-4.2-.8c-1.2-.6-2.3-1.3-3.1-2.3-.9-1-1.5-2.1-2-3.4-.4-1.3-.7-2.7-.7-4.2s.2-2.9.7-4.2c.4-1.3 1.1-2.4 2-3.4.9-1 1.9-1.7 3.1-2.3 1.2-.5 2.6-.8 4.2-.8zm0 17.6c.9 0 1.7-.2 2.4-.5s1.3-.8 1.7-1.4c.5-.6.8-1.3 1.1-2.2.2-.8.4-1.7.4-2.7v-.1c0-1-.1-1.9-.4-2.7-.2-.8-.6-1.6-1.1-2.2-.5-.6-1.1-1.1-1.7-1.4-.7-.3-1.5-.5-2.4-.5s-1.7.2-2.4.5-1.3.8-1.7 1.4c-.5.6-.8 1.3-1.1 2.2-.2.8-.4 1.7-.4 2.7v.1c0 1 .1 1.9.4 2.7.2.8.6 1.6 1.1 2.2.5.6 1.1 1.1 1.7 1.4.6.3 1.4.5 2.4.5zM88.9 28 83 7h4.7l4 15.7h.1l4-15.7h4.7l-5.9 21h-5.7zm28.8-3.6c.6 0 1.2-.1 1.7-.3.5-.2 1-.4 1.4-.8.4-.4.7-.8.9-1.4.2-.6.3-1.2.3-2v-13h4.1v13.6c0 1.2-.2 2.2-.6 3.1s-1 1.7-1.8 2.4c-.7.7-1.6 1.2-2.7 1.5-1 .4-2.2.5-3.4.5-1.2 0-2.4-.2-3.4-.5-1-.4-1.9-.9-2.7-1.5-.8-.7-1.3-1.5-1.8-2.4-.4-.9-.6-2-.6-3.1V6.9h4.2v13c0 .8.1 1.4.3 2 .2.6.5 1 .9 1.4.4.4.8.6 1.4.8.6.2 1.1.3 1.8.3zm13-17.4h4.2v9.1l7.4-9.1h5.2l-7.2 8.4L148 28h-4.9l-5.5-9.4-2.7 3V28h-4.2V7zm-27.6 16.1c-1.5 0-2.7 1.2-2.7 2.7s1.2 2.7 2.7 2.7 2.7-1.2 2.7-2.7-1.2-2.7-2.7-2.7z"></path>
          +             </svg>
          +           </a>
          +         </div>
          +         <div class="govuk-header__content">
          +           <a href="https://pre-portal.staging.platform.hmcts.net/" class="govuk-header__link govuk-header__service-name">
          +             HMCTS Pre-Recorded Evidence Service
          +           </a>
          +         </div>
          +       </div>
          +     </header>
          + 
          +     <main class="govuk-main-wrapper" id="main-content" role="main">
          +       <div class="govuk-width-container">
          +           <div class="govuk-grid-row">
          +             <div class="govuk-grid-column-two-thirds">
          + 
          +               <div id="api">
          +                 <!-- B2C content goes here -->
          +               </div>
          + 
          +             </div>
          +           </div>
          +       </div>
          +     </main>
          + 
          +     <footer class="govuk-footer" role="contentinfo">
          +       <div class="govuk-width-container">
          +         <div class="govuk-footer__meta">
          +           <div class="govuk-footer__meta-item govuk-footer__meta-item--grow">
          +             <h2 class="govuk-visually-hidden">Support links</h2>
          +             <ul class="govuk-footer__inline-list">
          +               <li class="govuk-footer__inline-list-item">
          +                 <a class="govuk-footer__link" href="https://pre-portal.staging.platform.hmcts.net/terms-and-conditions" target="_blank">
          +                   Terms and conditions
          +                 </a>
          +               </li>
          +               <li class="govuk-footer__inline-list-item">
          +                 <a class="govuk-footer__link" href="https://pre-portal.staging.platform.hmcts.net/accessibility-statement" target="_blank">
          +                   Accessibility statement
          +                 </a>
          +               </li>
          +             </ul>
          +             <svg aria-hidden="true" focusable="false" class="govuk-footer__licence-logo" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 483.2 195.7" height="17" width="41">
          +               <path fill="currentColor" d="M421.5 142.8V.1l-50.7 32.3v161.1h112.4v-50.7zm-122.3-9.6A47.12 47.12 0 0 1 221 97.8c0-26 21.1-47.1 47.1-47.1 16.7 0 31.4 8.7 39.7 21.8l42.7-27.2A97.63 97.63 0 0 0 268.1 0c-36.5 0-68.3 20.1-85.1 49.7A98 98 0 0 0 97.8 0C43.9 0 0 43.9 0 97.8s43.9 97.8 97.8 97.8c36.5 0 68.3-20.1 85.1-49.7a97.76 97.76 0 0 0 149.6 25.4l19.4 22.2h3v-87.8h-80l24.3 27.5zM97.8 145c-26 0-47.1-21.1-47.1-47.1s21.1-47.1 47.1-47.1 47.2 21 47.2 47S123.8 145 97.8 145"></path>
          +             </svg>
          +             <span class="govuk-footer__licence-description">
          +                 All content is available under the
          +                 <a class="govuk-footer__link" href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
          +             </span>
          +           </div>
          +           <div class="govuk-footer__meta-item">
          +             <a class="govuk-footer__link govuk-footer__copyright-logo" href="https://www.nationalarchives.gov.uk/information-management/re-using-public-sector-information/uk-government-licensing-framework/crown-copyright/">© Crown copyright</a>
          +           </div>
          +         </div>
          +       </div>
          +     </footer>
          +   </body>
          + </html>
        EOT
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["1"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_type           = "text/css" -> "image/x-png"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = <<-EOT # forces replacement
          - css/govuk-frontend-5.2.0.min.css
          + @charset "UTF-8";
          + :root {
          +   --govuk-frontend-version: "5.1.0";
          +   --govuk-frontend-breakpoint-mobile: 20rem;
          +   --govuk-frontend-breakpoi

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

nt-size:14pt!important;line-height:1.15!important}}.govuk-\!-font-size-16{font-size:.875rem!important;line-height:1.1428571429!important}@media (min-width:40.0625em){.govuk-\!-font-size-16{font-size:1rem!important;line-height:1.25!important}}@media print{.govuk-\!-font-size-16{font-size:14pt!important;line-height:1.2!important}}.govuk-\!-font-size-14{font-size:.75rem!important;line-height:1.25!important}@media (min-width:40.0625em){.govuk-\!-font-size-14{font-size:.875rem!important;line-height:1.4285714286!important}}@media print{.govuk-\!-font-size-14{font-size:12pt!important;line-height:1.2!important}}.govuk-\!-font-weight-regular{font-weight:400!important}.govuk-\!-font-weight-bold{font-weight:700!important}.govuk-\!-width-full,.govuk-\!-width-three-quarters{width:100%!important}@media (min-width:40.0625em){.govuk-\!-width-three-quarters{width:75%!important}}.govuk-\!-width-two-thirds{width:100%!important}@media (min-width:40.0625em){.govuk-\!-width-two-thirds{width:66.66%!important}}.govuk-\!-width-one-half{width:100%!important}@media (min-width:40.0625em){.govuk-\!-width-one-half{width:50%!important}}.govuk-\!-width-one-third{width:100%!important}@media (min-width:40.0625em){.govuk-\!-width-one-third{width:33.33%!important}}.govuk-\!-width-one-quarter{width:100%!important}@media (min-width:40.0625em){.govuk-\!-width-one-quarter{width:25%!important}}
          + /*# sourceMappingURL=govuk-frontend-5.2.0.min.css.map */
        EOT
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css.map" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["20"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_type           = "application/javascript" -> "application/octet-stream"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "js/b2c.js" -> "assets/fonts/bold-b542beb274-v2.woff2" # forces replacement
      ~ source                 = "./b2c/views/js/b2c.js" -> "./b2c/views/assets/fonts/bold-b542beb274-v2.woff2" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["21"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/fonts/light-f591b13f7d-v2.woff"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/light-f591b13f7d-v2.woff"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["22"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/fonts/light-94a07e06a1-v2.woff2"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/light-94a07e06a1-v2.woff2"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["23"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/fonts/bold-affa96571d-v2.woff"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/fonts/bold-affa96571d-v2.woff"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["24"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_type           = "application/javascript"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "js/b2c.js"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/js/b2c.js"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["3"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_type           = "application/javascript" -> "application/octet-stream"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js.map" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = <<-EOT # forces replacement
          - js/govuk-frontend-5.2.0.min.js.map
          + function moveForgotPassword() {
          +   const forgotPasswordId = 'forgotPassword'
          +   const forgotPassword = document.getElementById(forgotPasswordId);
          + 
          +   if (forgotPassword) {
          +     const text = forgotPassword.innerHTML;
          +     forgotPassword.remove();
          + 
          +     const newForgotPassword = document.createElement('a');
          +     newForgotPassword.id = forgotPasswordId;
          +     newForgotPassword.innerHTML = text;
          +     newForgotPassword.href = forgotPassword.href;
          + 
          +     const div = document.createElement('div');
          +     div.appendChild(newForgotPassword);
          + 
          +     const passwordInput = document.getElementById('password');
          +     passwordInput.parentNode.insertBefore(div, passwordInput.nextSibling);
          +   }
          + }
          + function moveRetryCode() {
          +   const retryCode = document.getElementById('retryCode');
          + 
          +   if (retryCode) {
          +     const text = retryCode.innerHTML;
          +     retryCode.remove();
          + 
          +     const newRetryCode = document.createElement('a');
          +     newRetryCode.id = 'retryCode';
          +     newRetryCode.innerHTML = text;
          + 
          +     const div = document.createElement('div');
          +     div.appendChild(newRetryCode);
          + 
          +     const verificationCodeInput = document.getElementById('verificationCode');
          +     verificationCodeInput.parentNode.insertBefore(div, verificationCodeInput.nextSibling);
          +   }
          + }
          + 
          + function addTsAndCsLink() {
          +   const tsAndCsBlock = document.getElementsByClassName('CheckboxMultiSelect')[0];
          +   if (tsAndCsBlock) {
          +     const tsAndCsLabel = tsAndCsBlock.getElementsByTagName('label')[0];
          +     const tsAndCsText = tsAndCsBlock.getElementsByTagName('label')[1];
          +     // fix the wrong for attribute supplied by B2C
          +     tsAndCsLabel.setAttribute('for', tsAndCsText.getAttribute('for'));
          +     if (tsAndCsText) {
          +       tsAndCsText.innerHTML = tsAndCsText.innerHTML = 'I agree to the <a href="https://pre-portal.staging.platform.hmcts.net/terms-and-conditions" target="_blank">Terms &amp; Conditions</a> (including Acceptable Use) for the Section 28 Video on Demand Portal.'
          +     }
          +   }
          + }
          + 
          + function addPasswordCriteria() {
          +   const passwordAttrEntry = document.querySelector('#attributeList li.Password .attrEntry');
          +   // passwordAttrEntry.setAttribute('style', 'margin-bottom: 2px;');
          +   const passwordDetails = document.createElement('details');
          +   passwordDetails.setAttribute('class', 'govuk-details');
          +   passwordDetails.setAttribute('data-module', 'govuk-details');
          +   passwordDetails.setAttribute('style', 'margin-top: 2px;');
          +   passwordDetails.innerHTML = '<summary class="govuk-details__summary">\n' +
          +     '                          <span class="govuk-details__summary-text">Password criteria</span>\n' +
          +     '                        </summary>\n' +
          +     '                        <div class="govuk-details__text">\n' +
          +     '                          Passwords must have at least 8 characters. <br />\n' +
          +     '                          Passwords must contain characters from at least three of the\n' +
          +     '                          following four classes: uppercase, lowercase, digit, and\n' +
          +     '                          non-alphanumeric (special).\n' +
          +     '                        </div>';
          +   passwordAttrEntry.appendChild(passwordDetails);
          + }
          + 
          + $(function() {
          +   moveForgotPassword();
          +   moveRetryCode();
          +   addTsAndCsLink();
          +   addPasswordCriteria();
          + });
        EOT
      ~ source                 = <<-EOT # forces replacement
          - ./b2c/views/js/govuk-frontend-5.2.0.min.js.map
          + ./b2c/views/function moveForgotPassword() {
          +   const forgotPasswordId = 'forgotPassword'
          +   const forgotPassword = document.getElementById(forgotPasswordId);
          + 
          +   if (forgotPassword) {
          +     const text = forgotPassword.innerHTML;
          +     forgotPassword.remove();
          + 
          +     const newForgotPassword = document.createElement('a');
          +     newForgotPassword.id = forgotPasswordId;
          +     newForgotPassword.innerHTML = text;
          +     newForgotPassword.href = forgotPassword.href;
          + 
          +     const div = document.createElement('div');
          +     div.appendChild(newForgotPassword);
          + 
          +     const passwordInput = document.getElementById('password');
          +     passwordInput.parentNode.insertBefore(div, passwordInput.nextSibling);
          +   }
          + }
          + function moveRetryCode() {
          +   const retryCode = document.getElementById('retryCode');
          + 
          +   if (retryCode) {
          +     const text = retryCode.innerHTML;
          +     retryCode.remove();
          + 
          +     const newRetryCode = document.createElement('a');
          +     newRetryCode.id = 'retryCode';
          +     newRetryCode.innerHTML = text;
          + 
          +     const div = document.createElement('div');
          +     div.appendChild(newRetryCode);
          + 
          +     const verificationCodeInput = document.getElementById('verificationCode');
          +     verificationCodeInput.parentNode.insertBefore(div, verificationCodeInput.nextSibling);
          +   }
          + }
          + 
          + function addTsAndCsLink() {
          +   const tsAndCsBlock = document.getElementsByClassName('CheckboxMultiSelect')[0];
          +   if (tsAndCsBlock) {
          +     const tsAndCsLabel = tsAndCsBlock.getElementsByTagName('label')[0];
          +     const tsAndCsText = tsAndCsBlock.getElementsByTagName('label')[1];
          +     // fix the wrong for attribute supplied by B2C
          +     tsAndCsLabel.setAttribute('for', tsAndCsText.getAttribute('for'));
          +     if (tsAndCsText) {
          +       tsAndCsText.innerHTML = tsAndCsText.innerHTML = 'I agree to the <a href="https://pre-portal.staging.platform.hmcts.net/terms-and-conditions" target="_blank">Terms &amp; Conditions</a> (including Acceptable Use) for the Section 28 Video on Demand Portal.'
          +     }
          +   }
          + }
          + 
          + function addPasswordCriteria() {
          +   const passwordAttrEntry = document.querySelector('#attributeList li.Password .attrEntry');
          +   // passwordAttrEntry.setAttribute('style', 'margin-bottom: 2px;');
          +   const passwordDetails = document.createElement('details');
          +   passwordDetails.setAttribute('class', 'govuk-details');
          +   passwordDetails.setAttribute('data-module', 'govuk-details');
          +   passwordDetails.setAttribute('style', 'margin-top: 2px;');
          +   passwordDetails.innerHTML = '<summary class="govuk-details__summary">\n' +
          +     '                          <span class="govuk-details__summary-text">Password criteria</span>\n' +
          +     '                        </summary>\n' +
          +     '                        <div class="govuk-details__text">\n' +
          +     '                          Passwords must have at least 8 characters. <br />\n' +
          +     '                          Passwords must contain characters from at least three of the\n' +
          +     '                          following four classes: uppercase, lowercase, digit, and\n' +
          +     '                          non-alphanumeric (special).\n' +
          +     '                        </div>';
          +   passwordAttrEntry.appendChild(passwordDetails);
          + }
          + 
          + $(function() {
          +   moveForgotPassword();
          +   moveRetryCode();
          +   addTsAndCsLink();
          +   addPasswordCriteria();
          + });
        EOT
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js.map" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["4"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_type           = "application/javascript" -> "text/html"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "js/govuk-frontend-5.2.0.min.js" -> "template.html" # forces replacement
      ~ source                 = "./b2c/views/js/govuk-frontend-5.2.0.min.js" -> "./b2c/views/template.html" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["5"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_type           = "text/html" -> "text/css"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/template.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "template.html" -> "css/main.css" # forces replacement
      ~ source                 = "./b2c/views/template.html" -> "./b2c/views/css/main.css" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/template.html" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["6"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_type           = "image/x-png" -> "text/css"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-crest.png" -> "css/govuk-frontend-5.2.0.min.css" # forces replacement
      ~ source                 = "./b2c/views/assets/images/govuk-crest.png" -> "./b2c/views/css/govuk-frontend-5.2.0.min.css" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest.png" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["7"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_type           = "image/x-ico" -> "text/css"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/favicon.ico" -> "css/govuk-frontend-5.2.0.min.css.map" # forces replacement
      ~ source                 = "./b2c/views/assets/images/favicon.ico" -> "./b2c/views/css/govuk-frontend-5.2.0.min.css.map" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["8"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_type           = "image/x-png" -> "application/javascript"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-icon-180.png" -> "js/govuk-frontend-5.2.0.min.js.map" # forces replacement
      ~ source                 = "./b2c/views/assets/images/govuk-icon-180.png" -> "./b2c/views/js/govuk-frontend-5.2.0.min.js.map" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["9"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_type           = "image/x-png" -> "application/javascript"
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-192.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "assets/images/govuk-icon-192.png" -> "js/govuk-frontend-5.2.0.min.js" # forces replacement
      ~ source                 = "./b2c/views/assets/images/govuk-icon-192.png" -> "./b2c/views/js/govuk-frontend-5.2.0.min.js" # forces replacement
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-192.png" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 25 to add, 0 to change, 21 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":791,"Program":"tfcmt","SHA1":"","Vars":{}} -->